{ "teachers": [{
  "name": "Jeanette Sager",
  "style": "Hatha",
  "profile": "A lifelong ballerina, Jeannette first started yoga when she had trouble finding adult ballet classes. Her second yoga class left her feeling like she 'was flying on a unicorn with wings.'' After that – she was hooked. Jeannette started teaching restorative yoga as a way to work with a family member with limited mobility and found herself branching into many other areas of teaching over the years – including hatha and vinyasa, to working with kids and even bringing yoga into prisons. Teaching yoga has been a humbling, rewarding and sanity-maintaining experience through many years of grad school. Even after racking up a pile of degrees, she can't imagine a life without teaching! Sharing the practices that have helped reduce stress and instill a mindset of self-compassion and acceptance, in her own life.",
  "workshops": "Morning Meditation Series",
  "image": "https://static1.squarespace.com/static/57eb10cc725e25b5bb128818/57ec88f1725e2504023e18b0/580528cf8419c2947e4f38e2/1493165094267/Jeanette-Sager-3_crop.jpg?format=300w",
  "pace": 2
}, {
  "name": "Michelina Payetta",
  "style": "Vinyasa",
  "profile": "Michelina is a registered yoga teacher with Yoga Alliance with a strong education in Kinesiology. Through yoga, Michelina has found overall balance and self-acceptance – allowing her to soften, and create a healthier way of living. She views yoga as a way to exercise not only her body – but her entire being – and describes the practice as “life-changing.” Michelina feels that yoga can be whatever you want and/or need it to be. For her, yoga is not only essential therapy and medicine, but it is her lifestyle. She intends for her classes to inspire a deeper connection to mind-body awareness, breath, mental clarity, physical strength and ultimately to make you feel more united with yourself. Michelina enjoys infusing yoga philosophy, concepts, quotes, and genuine life happenings into her classes. It is her passion to share the gift of yoga with you.",
  "workshops": "Handstand Practice",
  "image": "https://static1.squarespace.com/static/57eb10cc725e25b5bb128818/57ec88f1725e2504023e18b0/58052f32e58c62df75eb3e5f/1496965262631/MichelinaPayetta4_crop.jpg?format=300w",
  "pace": 3
}, {
  "name": "Shaney Albers",
  "style": "Power Vinyasa",
  "profile": "I grew up in the industry of health and fitness, as my family owned and operated a fitness center for 17 years. Since 1995, I have instructed a variety of group exercise classes as well as worked with several clients in personal fitness training. I began pursuing formal yoga teacher training in 2000 and acquired a certification from the White Lotus Foundation in Santa Barbara, CA the following year. Since my initial certification, I’ve studied under a number of influential teachers and yoga disciplines that have encouraged me to explore and share the freedom of Self in a Vinyasa Flow environment. I’ve also been a licensed massage therapist since December, 2000. I completed my Bachelor of Science degree in Community Health Education at Portland State University in 2005. My years of experience bring insight to my instruction, which encourages anatomical and kinesthetic correctness, as well as personal awareness and growth.",
  "workshops": "Thailand Retreat",
  "image": "https://static1.squarespace.com/static/57eb10cc725e25b5bb128818/57ec88f1725e2504023e18b0/57ec8914725e2504023e19e1/1493164085189/Shaney-Aalbers_crop.jpg?format=750w",
  "pace": 5
  }, {
    "name": "Nathan Mills",
    "style": "Slow Flow",
    "profile": "Nathan is a renowned teacher of yoga, healing movement and martial arts with over 14 years of teaching experience and over 30 years of practice. He inspires us to move thoughtfully, practice mindfully and to be present and aware with every brilliant breath our life has to give. You will be inspired by the way practicing with Nathan over time enhances your strength and abilities not just on a yoga mat—but in all facets of life. Born handicapped, Nathan was given the gift of yoga and movement as a child. These practices have continually healed Nathan through much adversity in the 40+ years he has been blessed to live on this amazing planet. His passion is to help inspire healing in others, and he works as a nutritional counselor and massage therapist when he’s not teaching movement classes. Nathan also loves to act and dance and travels periodically to perform in the occasional independent film.",
    "workshops": "Foundations",
    "image": "https://static1.squarespace.com/static/57eb10cc725e25b5bb128818/57ec88f1725e2504023e18b0/57ec891f725e2504023e1a43/1493164871310/Nathan+Mills.jpg?format=300w",
    "pace": 2
    }, {
      "name": "Lindsey Holly",
      "style": "Power Vinyasa",
      "profile": "I believe that yoga can make impactful changes in both body and mind. I have personally experienced more courage, clarity and stability in my life since I started practicing yoga seven years ago. I've created a unique Vinyasa style that draws on various techniques from Ashtanga and Power Yoga, while reflecting the core value of the Krishnamacharya lineage. My classes are creative, challenging, invigorating, smoothly sequenced and infused with practical yoga philosophy. I emphazise exploring the pulse of the breath, its relationship to the body and the way that it can serve as aconnection between one's inner awareness and one’s outer action. It’s my goal to never teach the same class twice. My classes offer a balance of poses for both strength and flexibility. I provide options for all levels and encourage students to stay focused on the breath to create calmness in the mind through challenging situations. It is my intention that my classes leave you feeling realigned, powerful, and stress-free.",
      "workshops": "",
      "image": "https://static1.squarespace.com/static/57eb10cc725e25b5bb128818/57ec88f1725e2504023e18b0/58053156bebafb5f19379764/1493164786061/Lindsey+Holy.jpg?format=300w",
      "pace": 4
  }]
}
